import './TCModalStyle.css'

export default function TCModal({ onClose}:any) {
  return (
    <div className="w-full h-full fixed top-0 left-0 z-[9999] backdrop-blur-sm bg-white/30">
      <div className="modal-detail-container overflow-hidden">
        <div className="modal-detail-content" style={{padding: "20px"}}>
          <p className="modal-title">ကမ်ပိန်းစည်းမျဉ်းစည်းကမ်းများ</p>
          <div className="modal-content">
              <div className="modal-item-value">
               Heineken®Refresh Your Music, Refresh
              Your Nights ကမ်ပိန်းကို မြန်မာနိုင်ငံသားမှတ်ပုံတင် (ID card)
              ကိုင်ဆောင်ထားသော (၂၈)ရက်၊ မတ်လ၊ ၂၀၂၄ ခုနှစ်တွင် အသက်
              (၂၁)နှစ်နှင့်အထက် ရှိပြီးဖြစ်သော သူများသာပါဝင်ခွင့်ရှိပါသည်။
              (၂၈)ရက်၊ မတ်လ၊ ၂၀၂၄ ခုနှစ်တွင် အသက် (၂၁)နှစ်မပြည့်သေးသူများ၊
              Heineken® မှဝန်ထမ်းများ နှင့် Heineken®၏မိတ်ဖက်
              အရောင်းမြှင့်တင်ရေးအေဂျင်စီများ၊ ၄င်းတို့၏ မိသားစုဝင်များ၊
              ဥပဒေအရတားမြစ်ခြင်းခံရသူများ ပါဝင်ခွင့်မရှိပါ။ Heineken® သည်
              လူမှုကွန်ရက်စာမျက်နှာ (social media)များမှ
              တဆင့်ကြိုတင်အကြောင်းကြား၍ ကမ်ပိန်းကျင်းပမည့် နေ့ရက်များကို
              ပြောင်းလဲရန်၊ ရုပ်သိမ်းရန် သို့မဟုတ် ပြန်လည်စီစဉ်ရန်
              ဆုံးဖြတ်ပိုင်ခွင့်ရှိထားသည်ကိုလည်း သိရှိရပါမည်။ ဆုလက်ဆောင်များမှာ
              Heineken YAMAHA Guitar, Heineken JBL Speaker, Heineken Earbuds,
              Heineken Waterproof Bag, Heineken Fanny Pack, Heineken T shirt
              နှင့် Heineken Water Bottle များဖြစ်ပါသည်။ ဆုလက်ဆောင်များကို
              www.refreshyourmusichnk.com ရှိ [Refresh with (artist’s
              name)](link) တွင် ဖော်ပြထားသောနည်းလမ်းများဖြင့် ရယူနိုင်ပါသည်။
              ဆုလက်ဆောင်များအား လူအစားထိုးလဲလှယ်ခြင်းများ၊
              အခြားအကျိုးခံစားခွင့်များနှင့် လဲလှယ်ခြင်း၊
              ငွေသားဖြင့်လှဲလှယ်ခြင်းများ ပြုလုပ်ပေးသွားမည်မဟုတ်ပါ။
              ဤကမ်ပိန်းတွင်ပါဝင်မည့်သူသည် Heineken®နှင့် ၎င်း၏မိတ်ဖက်များကို
              ဆုလက်ဆောင်များတွင် မပါဝင်ဘဲ တစ်ပိုင်းတစ်စ၊ သို့မဟုတ် အပြည့်အဝ
              ဖြစ်ပေါ်လာနိုင်သော၊ သို့မဟုတ် ပြိုင်ပွဲဝင်သူတွင် ရှိသော
              ဆုံးရှုံးမှုများ၊ အခွင့်အရေးများ၊ တောင်းဆိုမှုများ၊
              ကုန်ကျမှုများနှင့် စပ်လျဉ်း၍ တိုက်ရိုက်ဖြစ်စေ၊ သွယ်ဝိုက်ဖြစ်စေ
              အပြစ်တင်စွဲ ဆိုနိုင်ခြင်းမရှိသည်ကို နားလည်ထားပြီး ဖြစ်ရပါမည်။
              ဤကမ်ပိန်းတွင် ပါဝင်ခြင်းအားဖြင့် ပါဝင်သူများသည်
              မိမိတို့ပါဝင်ယှဉ်ပြိုင်ထားသော သီချင်းများ၊ Video များ၊
              ဓာတ်ပုံများနှင့် ပတ်သက်သော မူပိုင်ခွင့်များအား Heineken® သို့
              ပေးအပ်ပြီးဖြစ်ပါသည်။ ပေးအပ်ထားသော မူပိုင်ခွင့်များတွင်
              အကြောင်းအရာများအား သင့်တော်သလို ပြန်လည်တည်းဖြတ်ခြင်း၊
              အပြောင်းအလဲများပြုလုပ်ခြင်း၊ စီးပွားရေး ကြော်ငြာများ ၊
              အရောင်းမြှင့်တင်ရေးလုပ်ငန်းများတွင် အသုံးပြုခြင်း၊ တိုက်ရိုက်
              အရောင်းမြှင့်တင်ခြင်း၊ အီလက်ထရောနစ်မီဒီယာများမှ တဆင့်
              အရောင်းမြှင့်တင်ခြင်း လုပ်ငန်းများတွင် အသုံးပြုခြင်းများအတွက်ပါ
              အခွင့်အရေးပေးထားပြီး ဖြစ်ကြောင်း အသိပေးအပ်ပါသည်။ အထက်ဖော်ပြပါ
              အချက်များအပြင် Heineken® သည် ကမ်ပိန်းစည်းမျဉ်းကန့်သတ်ချက်များအား
              ကြိုတင်အကြောင်းကြားခြင်းမပြုဘဲ ပြင်ဆင်ခြင်း၊ ဖြည့်စွက်ခြင်း၊
              အစားထိုးခြင်းများ ပြုလုပ်နိုင်ခွင့် ရှိပါသည်။ ဤကမ်ပိန်းတွင်
              ပါဝင်ခြင်းဖြင့် အဆိုပါပြင်ဆင်မှုများ၊
              ဖြည့်စွက်မှု၊အစားထိုးမှုများနှင့်အတူ စည်းမျဉ်းကန့်သတ်ချက်များနှင့်
              အားလုံးကို Heineken® မှ နောက်ဆုံး ဆုံးဖြတ်မည်ကို သိရှိလက်ခံထားပြီး
              ဖြစ်ပါသည်။ ကမ်ပိန်းအစီစဉ်များ၊ စည်းမျဉ်းကန့်သတ်ချက်ကို
              မြန်မာနိုင်ငံ၏ ဥပဒေများဖြင့် ထိန်းသိမ်းကြီးကြပ်သွားပါမည်။
        </div>
          </div>
          <button className="close-button" style={{ paddingBottom: '10px' }} onClick={onClose}>
            Close
          </button>
        </div>
      </div>
    </div>
  )
}
